app/controllers/schedules_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "majors".* FROM "majors" WHERE "majors"."major_minorID" = ? LIMIT 1  [["major_minorID", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."uni" = ?  [["uni", "sma2243"]]
---
  def index
    @majorID = (Student.find_by_id(session[:student_id])).major1
    @uni = (Student.find_by_id(session[:student_id])).uni
    @major = Major.find_by_major_minorID(@majorID)
    @major_name = @majorID ? @major.name : ""
    @schedule = Schedule.get_full_schedule().where(uni: @uni) #schedule specific to student

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def add_course
    @uni = (Student.find_by_id(session[:student_id])).uni

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."uni" = ?  [["uni", "sma2243"]]
SELECT "schedules"."courseID" FROM "schedules" WHERE "schedules"."uni" = ?  [["uni", "sma2243"]]
SELECT  "courses".* FROM "courses" WHERE "courses"."courseID" = ? LIMIT 1  [["courseID", 2]]
INSERT INTO "schedules" ("uni", "courseID", "semester", "reqID") VALUES (?, ?, ?, ?)  [["uni", "sma2243"], ["courseID", 1], ["semester", "f22"], ["reqID", 2]]
---
  def create
    @uni = (Student.find_by_id(session[:student_id])).uni
    @my_courses = Schedule.where(uni: @uni)
    @course_ids = @my_courses.pluck(:courseID).map(&:to_s)
    @course_id_to_check = schedule_params[:courseID].to_s
    if @course_ids.include?(@course_id_to_check)
      flash[:notice] = "Course '#{Course.find(@course_id_to_check).courseTitle}' already added."
      redirect_to add_course_path
    else
      #if from all-courses page, check if it fulfills a major req. if yes, change the schedule_params
      # if (schedule_params[:reqID] == 1)
      #   req = Coursereqs.where(courseID == schedule_params[:courseID])
      #   if(req)
      #     schedule_params[:reqID] = req.first.reqID
      #   end
      # end
      @schedule = Schedule.create!(schedule_params)

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."schedID" = ? LIMIT 1  [["schedID", 5]]
DELETE FROM "schedules" WHERE "schedules"."schedID" = ?  [["schedID", 5]]
---
  def destroy
    @id = params[:schedID]
    @schedule = Schedule.find(@id)
    @course_id = @schedule.courseID
    @schedule.destroy