app/controllers/sessions_controller.rb

	def create
	  #flash[:notice] = " Email: #{params[:email]}"
	  @student = Student.find_by(email: params[:email])
---
SELECT  "students".* FROM "students" WHERE "email"."{:class=>""form-control""}" = 'sma2243@columbia.edu' LIMIT 1