app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
	def profile
		# id = params[:schedID] # retrieve schedID from URI route
		@student = Student.find(session[:student_id]) # look up schedule by unique ID